#ifndef _DES_H
#define _DES_H

typedef unsigned char byte;

int byte_map[8] = {0x80,0x40,0x20,0x10,0x08,0x04,0x02,0x01};
int byte_set1_map[8] = {0x80,0x40,0x20,0x10,0x08,0x04,0x02,0x01};
int byte_set0_map[8] = {0x7F,0xBF,0xDF,0xEF,0xF7,0xFB,0xFD,0xFE};

/* PC1映射表，用于将64位原始密钥置换成56位, 用于密钥初始置换 */
int pc1_map[56] = {
    57,49,41,33,25,17,9,
    1, 58,50,42,34,26,18,
    10,2, 59,51,43,35,27,
    19,11,3, 60,52,44,36,
    63,55,47,39,31,23,15,
    7, 62,54,46,38,30,22,
    14,6, 61,53,45,37,29,
    21,13,5, 28,20,12,4
};

/* PC2映射表，用于将56位密钥置换成48位, 用于Key Schedule置换 */
int pc2_map[48] = {
    14,17,11,24,1, 5,
    3, 28,15,6, 21,10,
    23,19,12,4, 26,8,
    16,7, 27,20,13,2,
    41,52,31,37,47,55,
    30,40,51,45,33,48,
    44,49,39,56,34,53,
    46,42,50,36,29,32
};

/* 密钥移位映射表，用于记录生成Key Schedule过程中每轮的左移位数 */
int key_shift_map[16] = {1,1,2,2,2,2,2,2,1,2,2,2,2,2,2,1};

#endif
